In [3]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=('Row1','Row2','Row3','Row4','Row5'),columns=('Colums1','Columns2','Columns3','Columns4'))

In [3]:
df.head()

      Colums1  Columns2  Columns3  Columns4
Row1        0         1         2         3
Row2        4         5         6         7
Row3        8         9        10        11
Row4       12        13        14        15
Row5       16        17        18        19

In [10]:
df.to_csv('Test1.csv')

In [11]:
##Accesing the elements
## 1.  loc  2.iloc

In [13]:
df.loc['Row1']

Colums1     0
Columns2    1
Columns3    2
Columns4    3
Name: Row1, dtype: int32

In [14]:
type(df.loc['Row1'])

pandas.core.series.Series

In [17]:
df.iloc[1:3,1:3]

      Columns2  Columns3
Row2         5         6
Row3         9        10

In [18]:
type(df.iloc[1:3,1:3])

pandas.core.frame.DataFrame

In [28]:
df.iloc[2:4,2:4]

      Columns3  Columns4
Row3        10        11
Row4        14        15

In [29]:
df.iloc[1:3,1:3].values

array([[ 5,  6],
       [ 9, 10]])

In [30]:
df.iloc[1:3,1:3].values.shape

(2, 2)

In [34]:
df.head()

      Colums1  Columns2  Columns3  Columns4
Row1        0         1         2         3
Row2        4         5         6         7
Row3        8         9        10        11
Row4       12        13        14        15
Row5       16        17        18        19

In [35]:
df['Colums1'].value_counts()

Colums1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [36]:
df.isnull().sum()

Colums1     0
Columns2    0
Columns3    0
Columns4    0
dtype: int64

In [37]:
df['Colums1'].unique()

array([ 0,  4,  8, 12, 16])

In [4]:
test_df=pd.read_csv('Test1.csv')

In [5]:
test_df.head()

  Unnamed: 0  Colums1  Columns2  Columns3  Columns4
0       Row1        0         1         2         3
1       Row2        4         5         6         7
2       Row3        8         9        10        11
3       Row4       12        13        14        15
4       Row5       16        17        18        19

In [6]:
from io import StringIO, BytesIO

In [8]:
data= ('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
      'c,d,3')

In [9]:
type(data)

str

In [21]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [23]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [24]:
df.to_csv('test.csv')

In [25]:
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [30]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11,12')

In [31]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [32]:
df=pd.read_csv(StringIO(data),dtype=object)

In [33]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [35]:
df=pd.read_csv(StringIO(data),dtype={'a':'Int64','b':int,'c':float})

In [36]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [37]:
df['a']

0    1
1    5
2    9
Name: a, dtype: Int64

In [38]:
df.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [39]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow,10')

In [41]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [45]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow,')

In [46]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [47]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [50]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow,')

In [53]:
pd.read_csv(StringIO(data), usecols=['b', 'c'],index_col=False)

        b    c
0   apple  bat
1  orange  cow

In [54]:
data='a,b\n"hello, \\"Bob\\", nice to see you",5'

In [55]:
pd.read_csv(StringIO(data),escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5